results/2026-05-28/benchmark_mysql_20260528_011742.txt
========================================
Sysbench Benchmark Suite
Driver: mysql
Tables: 4 x 10000 rows
Threads: 4, Time: 10s
Script start: Thu May 28 01:17:42 AM CEST 2026
========================================
Benchmarks start: Thu May 28 01:17:42 AM CEST 2026
========================================

--- oltp_point_select ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            558830
        write:                           0
        other:                           0
        total:                           558830
    transactions:                        558830 (55879.13 per sec.)
    queries:                             558830 (55879.13 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      55879.1261
    time elapsed:                        10.0007s
    total number of events:              558830

Latency (ms):
         min:                                    0.04
         avg:                                    0.07
         max:                                    9.06
         95th percentile:                        0.12
         sum:                                39751.89

Threads fairness:
    events (avg/stddev):           139707.5000/1305.33
    execution time (avg/stddev):   9.9380/0.00


--- oltp_read_only ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            369894
        write:                           0
        other:                           52842
        total:                           422736
    transactions:                        26421  (2639.13 per sec.)
    queries:                             422736 (42226.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2639.1304
    time elapsed:                        10.0113s
    total number of events:              26421

Latency (ms):
         min:                                    0.91
         avg:                                    1.51
         max:                                   84.84
         95th percentile:                        2.03
         sum:                                39971.73

Threads fairness:
    events (avg/stddev):           6605.2500/36.85
    execution time (avg/stddev):   9.9929/0.00


--- oltp_read_write ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            117810
        write:                           33660
        other:                           16830
        total:                           168300
    transactions:                        8415   (841.07 per sec.)
    queries:                             168300 (16821.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      841.0712
    time elapsed:                        10.0051s
    total number of events:              8415

Latency (ms):
         min:                                    3.58
         avg:                                    4.75
         max:                                   28.05
         95th percentile:                        7.30
         sum:                                39992.57

Threads fairness:
    events (avg/stddev):           2103.7500/8.50
    execution time (avg/stddev):   9.9981/0.00


--- oltp_insert ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           10738
        other:                           0
        total:                           10738
    transactions:                        10738  (1073.53 per sec.)
    queries:                             10738  (1073.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1073.5283
    time elapsed:                        10.0025s
    total number of events:              10738

Latency (ms):
         min:                                    1.79
         avg:                                    3.72
         max:                                   16.41
         95th percentile:                        4.82
         sum:                                39967.67

Threads fairness:
    events (avg/stddev):           2684.5000/2.06
    execution time (avg/stddev):   9.9919/0.00


--- oltp_delete ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11709
        other:                           2115
        total:                           13824
    transactions:                        13824  (1382.03 per sec.)
    queries:                             13824  (1382.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1382.0303
    time elapsed:                        10.0027s
    total number of events:              13824

Latency (ms):
         min:                                    0.07
         avg:                                    2.89
         max:                                   11.50
         95th percentile:                        4.25
         sum:                                39989.19

Threads fairness:
    events (avg/stddev):           3456.0000/17.45
    execution time (avg/stddev):   9.9973/0.00


--- oltp_update_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11210
        other:                           0
        total:                           11210
    transactions:                        11210  (1120.68 per sec.)
    queries:                             11210  (1120.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1120.6837
    time elapsed:                        10.0028s
    total number of events:              11210

Latency (ms):
         min:                                    1.58
         avg:                                    3.57
         max:                                   13.22
         95th percentile:                        4.82
         sum:                                39986.89

Threads fairness:
    events (avg/stddev):           2802.5000/2.06
    execution time (avg/stddev):   9.9967/0.00


--- oltp_update_non_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           10954
        other:                           0
        total:                           10954
    transactions:                        10954  (1094.52 per sec.)
    queries:                             10954  (1094.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1094.5205
    time elapsed:                        10.0080s
    total number of events:              10954

Latency (ms):
         min:                                    1.82
         avg:                                    3.65
         max:                                   18.31
         95th percentile:                        4.74
         sum:                                40000.62

Threads fairness:
    events (avg/stddev):           2738.5000/2.87
    execution time (avg/stddev):   10.0002/0.00


--- select_random_points ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            256160
        write:                           0
        other:                           0
        total:                           256160
    transactions:                        256160 (25613.79 per sec.)
    queries:                             256160 (25613.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      25613.7911
    time elapsed:                        10.0009s
    total number of events:              256160

Latency (ms):
         min:                                    0.08
         avg:                                    0.16
         max:                                   10.30
         95th percentile:                        0.23
         sum:                                39791.15

Threads fairness:
    events (avg/stddev):           64040.0000/1646.33
    execution time (avg/stddev):   9.9478/0.01


--- select_random_ranges ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            248533
        write:                           0
        other:                           0
        total:                           248533
    transactions:                        248533 (24850.63 per sec.)
    queries:                             248533 (24850.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      24850.6316
    time elapsed:                        10.0011s
    total number of events:              248533

Latency (ms):
         min:                                    0.10
         avg:                                    0.16
         max:                                    6.17
         95th percentile:                        0.21
         sum:                                39818.59

Threads fairness:
    events (avg/stddev):           62133.2500/878.80
    execution time (avg/stddev):   9.9546/0.00


--- bulk_insert ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           4
        other:                           0
        total:                           4
    transactions:                        10000  (203700.00 per sec.)
    queries:                             4      (81.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      203699.9986
    time elapsed:                        0.0491s
    total number of events:              10000

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.09
         95th percentile:                        0.00
         sum:                                    4.13

Threads fairness:
    events (avg/stddev):           2500.0000/157.44
    execution time (avg/stddev):   0.0010/0.00


========================================
Script start:     2026-05-28 01:17:42
Benchmarks start: 2026-05-28 01:17:42
Script end:       2026-05-28 01:19:24
Prep time:        0s
Benchmark time:   102s
Total time:       102s
Results saved to: benchmark_mysql_20260528_011742.txt
========================================